---
kind: property
id: P:Autodesk.Revit.DB.BuiltInFailures.StairRampFailures.BalusterUpsideDown
source: html/e8681dc5-3bff-2f4f-799e-414ed1c42a9f.htm
---
# Autodesk.Revit.DB.BuiltInFailures.StairRampFailures.BalusterUpsideDown Property

Top reference is below Bottom reference for one or more Balusters. These Balusters are not created.

## Syntax (C#)
```csharp
public static FailureDefinitionId BalusterUpsideDown { get; }
```